/*
 Решает систему линейных уравнений с помощью
 алгоритма гауса-жардана с выбором глааного элемента.
*/
#include <stdio.h>

//=============================================================================
void ftrash (FILE *fp, int n);
void fileRead();
void writeMatrix(double *x);
void writeAnswer();
void writeFile();
void faultCalculation();

//=============================================================================
int N; //размерность матрицы.
double *matrix; //одномерный массив для матрицы.
double *b;
double *x;
double *fault;

//=============================================================================
int main()
{
  fileRead();
//-----------------------------------------------------------------------------
  x = new double[N];
//-----------------------------------------------------------------------------
  writeMatrix(matrix);
//-----------------------------------------------------------------------------
  for (int i = 0; i < N-1; i++)
  {
    int indexMaxLine = i;

    for (int j = i+1; j < N; j++) //max a_ii
      if (matrix[j*N] > matrix[indexMaxLine * N])
        {indexMaxLine = j;}

    if (indexMaxLine != i)
    {  
      double tmp;
      for (int j = i; j < N; j++) 
      {
        tmp = matrix[i*N + j];
        matrix[i*N + j] = matrix[indexMaxLine * N  +  j];
        matrix[indexMaxLine * N  +  j] = tmp;
      }
      tmp = b[i];
      b[i] = b[indexMaxLine];
      b[indexMaxLine] = tmp; 
    }
//--------------------------------------------

    for (int j = i+1; j < N; j++)
    {
      double cof = -matrix[j*N + i]/matrix[i*N + i];
      //sumLine(matrix, i, j, cof);

      for (int k = i; k < N; k++)
        {matrix[j*N + k] += cof*matrix[i*N + k];}

      b[j] += cof*b[i];
    }
  }
//--------------------------------------------
  writeMatrix(matrix);
//--------------------------------------------
  
  for (int i = N-1; i > 0; i--)
    for (int j = i; j--;) 
    {
      double cof = -matrix[j*N + i]/matrix[i*N + i];

      for (int k = N-1; k >= j; k--)
        {matrix[j*N + k] += cof*matrix[i*N + k];}

      b[j] += cof*b[i];
    }
//-----------------------------------------------------------------------------
  writeMatrix(matrix);
//-----------------------------------------------------------------------------
  for (int i = 0; i < N; i++)
    {x[i] = b[i]/matrix[i*N + i];}
//-----------------------------------------------------------------------------
  faultCalculation();
//-----------------------------------------------------------------------------
  writeAnswer();
//-----------------------------------------------------------------------------
  writeMatrix(matrix);
//-----------------------------------------------------------------------------
  writeFile();
};
//=============================================================================

void faultCalculation()
{
  FILE *fp;
  fp = fopen ("matrix.txt", "r");
//--------------------------------------------
  ftrash (fp, 5);
  for (int i = 0; i < N*N; i++)
    {fscanf(fp, "%lf", &matrix[i]);}
//--------------------------------------------
  for (int i = 0; i < N; i++)
    {fscanf(fp, "%lf", &b[i]);}
//--------------------------------------------
  fclose(fp);
//-----------------------------------------------------------------------------
  fault = new double[N];

  for (int i = 0; i < N; i++)
  {
    double sum = 0;
    for (int j = 0; j < N; j++)
    {
      sum += x[j]*matrix[i*N + j];
      printf("%lf \n",sum);
    }
    fault[i] = sum - b[i];
  }
};
//=============================================================================

void writeFile()
{
  FILE *fp;
  fp = fopen ("answer.txt", "w");
//-----------------------------------------------------------------------------
  fprintf(fp, "N = %d \n", N);
//--------------------------------------------
  for (int i = 0; i < N; i++)
  {
    for (int j = 0; j < N; j++)
      {fprintf(fp, "%4.2lf  ", matrix[i*N+j]);}

    fprintf(fp, "%4.2lf \n", b[i]);
  }
  fprintf(fp, "\n");
//--------------------------------------------
for (int i = 0; i < N; i++) 
    {fprintf(fp, "x[%d] = %lf \n", i, x[i]);}
//--------------------------------------------
for (int i = 0; i < N; i++)
    {fprintf(fp, "fault[%d] = %lf \n", i, fault[i]);}
//-----------------------------------------------------------------------------
  fclose(fp);
};
//=============================================================================

void writeMatrix(double *array)
{
  printf("\n");
  printf("N = %d \n", N);

  for (int i = 0; i < N; i++)
  {
    for (int j = 0; j < N; j++)
      {printf("%4.2lf  ", array[i*N+j]);}

    printf("   %lf \n", b[i]);
  }
  printf("\n");
};
//=============================================================================

void writeAnswer()
{
  for (int i = 0; i < N; i++) 
    {printf("x[%d] = %lf \n", i, x[i]);}
//--------------------------------------------
  for (int i = 0; i < N; i++)
    {printf("fault[%d] = %lf \n", i, fault[i]);}
};
//=============================================================================

void fileRead()
{
  FILE *fp;
  fp = fopen ("matrix.txt", "r");
//-----------------------------------------------------------------------------
  ftrash (fp, 3);
  fscanf(fp, "%d", &N);
//--------------------------------------------
  matrix = new double[N*N];
  b = new double[N];
//--------------------------------------------
  ftrash (fp, 1);
  for (int i = 0; i < N*N; i++)
    {fscanf(fp, "%lf", &matrix[i]);}
//--------------------------------------------
  for (int i = 0; i < N; i++)
    {fscanf(fp, "%lf", &b[i]);}
//-----------------------------------------------------------------------------
  fclose(fp);
};
//=============================================================================

void ftrash (FILE *fp, int n)
{
  char trash[500];
  for (int i = n; i--;)
    {fscanf(fp, "%s", trash);}
};
